<?php

use App\Project;
use Illuminate\Database\Seeder;
use Spatie\MediaLibrary\Exceptions\FileCannotBeAdded\DiskDoesNotExist;
use Spatie\MediaLibrary\Exceptions\FileCannotBeAdded\FileDoesNotExist;
use Spatie\MediaLibrary\Exceptions\FileCannotBeAdded\FileIsTooBig;

class ProjectsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     * @throws DiskDoesNotExist
     * @throws FileDoesNotExist
     * @throws FileIsTooBig
     */
    public function run()
    {


        $facts = [
            'От 65 до 90 снежных барсов всего осталось в России. Для сравнения столько же людей поместится в 1 автобус',
            'Снежный барс – остается одним из наименее изученных видов кошек в мире, потому что живет в труднодоступных горных районах',
            'В отличие от других больших кошек Снежный барс не умеет рычать, но умеет мурлыкать',
            'Снежные барсы – одиночки, вместе можно увидеть только самку с котятами',
            'Снежные барсы используют свой пушистый хвост как одеяло',
            'Снежные барсы самые прыгучие кошки. Они могут прыгнуть на 10 метров в высоту',
            'Снежные барсы живут в горах на высоте до 5 000 метров. Для сравнения высота Эвереста – 8 848 метров',
            'Ирбисы – хищники, один пойманый козерог обеспечит кошку мясом на неделю вперед',
            'Ирбис может поймать добычу в 3 раза тяжелее собственного веса',
            'Так как Снежные барсы одиночки, они делят территории по 100-500 кв. километров и могут не пересекаться с другими барсами',
            'Ирбисы занесены в Красную книгу и им присвоена первая категория редкости (под угрозой исчезновения)',
            'Охота на Снежного барса запрещена во всём мире. Всего в мире осталось до 4 000 особей',
            'Несмотря на своё название, Снежные барсы не любят снег, они предпочитают передвигаться по тропам',
            'Ирбис никогда не нападёт на человека. Он предпочтёт затаиться и уйти',
            'Если Снежный барс попадёт в загоны скотоводов, живущих в горах, то может убить до 20 овец или коз, что гораздо больше, чем ему нужно для еды. Скотоводы негодуют :(',
            'В среднем барсы живут 11-13 лет в дикой природе. В неволе доживают до 20. Был зафиксирован случай, когда самка дожила до 28 лет',
            'Подсчёт Снежных барсов проводят по фото- и видеорегистраторам, а зимой ещё и по следам животных на снегу. Встретить Ирбиса большая редкость',
            'Если охоте барсу мешает другой хищник (например, волк), то он Ирбис не вступит в драку и убежит',
            'Если охота у барса не удалась, он не догоняет жертву, а экономит силы и ждёт другого удачного момента',
            'У каждого учтённого барса имеется свой паспорт в базе данных «Ирбис». В нём хранятся описание особи, фото и видео из фотоловушек и место/время встречи с ним',
        ];

        $project = Project::create([
            'name' => 'Защитим снежного барса в республике Алтай',
            'description' => 'Помогите сделать местообитания снежного барса в природных парках Алтая более безопасными',
            'prize' => 'panda',
            'goal_funds' => 3040000,
            'raised_funds' => 273600,
            'is_active' => true,
            'status' => Project::APPROVED
        ]);

        $project->addMedia(storage_path('app/seed/panda.png'))->preservingOriginal()->toMediaCollection('poster');
        $project->addMedia(storage_path('app/seed/bars.jpg'))->preservingOriginal()->toMediaCollection('banner');

        foreach ($facts as $fact) {
            $project->projectFacts()->create([
                'text' => $fact
            ]);
        }
    }
}
