<?php

use Illuminate\Database\Seeder;

class ProjectFactsActiveProjectTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $facts = [
            'Площадь Командорского заповедника более 3 миллионов гектаров – такую же территорию занимает, например, Бельгия.',
            'Остров Беринга - самый крупный остров Командорского архипелага известный тем, что у его берегов потерпел крушение пакетбот (почтово-пассажирское судно) Витуса Беринга во время второй камчатской экспедиции.',
            'Туристы едут на Остров Беринга, чтобы увидеть нетронутую природу и редких животных, которые почти не боятся людей. Здесь расположено Северо-Западное лежбище.',
            'Зеленые сопки, песчаные дюны, бурные воды Тихого океана и Берингова моря, фонтаны китов, многотысячные птичьи базары и огромные лежбища морских котиков и сивучей, — все эти природные богатства хранятся благодаря работе заповедника.',
            'С расстояния всего в несколько десятков метров на острове можно понаблюдать за жизнью ушастых и обыкновенных тюленей: сивучей, северных морских котиков и антуров.',
            'Обустройство тропы обеспечит возможность туристам не только увидеть  неповторимую природу Командор, но и сохранить ее первозданную красоту.'
        ];

        $project = \App\Project::getActive();

        if ($project) {
            foreach ($facts as $fact) {
                $project->projectFacts()->create([
                    'text' => $fact
                ]);
            }
        }
    }
}
